YanqiS/stm32temp1/main.c
		//		uint8_t TA531_Callback_flag[8] ;
		//		uint8_t TA531_Callback_key[8] ;
		//		uint32_t TA531_Callback_tim[8] ;
		for (int i = 1; i < 8; i++)		//release key
				{
			if (TA531TimCallback.TA531_Callback_flag[i] == 1) {
				if (TA531TimCallback.TA531_Callback_tim[i] < Sys_TIM_TICK) {
					switch (i) {
					case 1:		//
						HAL_GPIO_WritePin(COM_RELAY_1_GPIO_Port,
						COM_RELAY_1_Pin, 0);
						break;
					case 2:		//
						HAL_GPIO_WritePin(COM_RELAY_2_GPIO_Port,
						COM_RELAY_2_Pin, 0);
						break;
					case 3:		//
						HAL_GPIO_WritePin(COM_RELAY_3_GPIO_Port,
						COM_RELAY_3_Pin, 0);
						break;
//					case 4:		//
//						HAL_GPIO_WritePin(GPIOE, COM_RELAY_4_Pin, 0);
//						break;
//					case 5:		//
//						HAL_GPIO_WritePin(GPIOE, COM_RELAY_5_Pin, 0);
//						break;
//					case 6:		//
//						HAL_GPIO_WritePin(GPIOB, COM_RELAY_6_Pin, 0);
//						break;
//					case 7:		//
//						HAL_GPIO_WritePin(GPIOB, COM_RELAY_7_Pin, 0);
//						break;
					}

					TA531TimCallback.TA531_Callback_flag[i] = 0;
				}
			}
		}

//////TEST LIN
//		TSA4_0x103_Flag = 1;
//		TA531_LIN_SWS.LIN_SWS_SWSCnfmSwA_1 = 	SW_BUTTON;
//		TA531_LIN_SWS.LIN_SWS_SWSSelUpSwA_1 = 	SW_UP;
//		TA531_LIN_SWS.LIN_SWS_SWSSelDwnSwA_1 = 	SW_DW;
//		TA531_LIN_SWS.LIN_SWS_SWSSelLSwA_1 = 	SW_LEFT;
//		TA531_LIN_SWS.LIN_SWS_SWSSelRSwA_1 = 	SW_RIGHT;

//		TSA4_0x104_Flag = 1;
//		if(SW_BUTTON)
//		{
//			Remote_state = 1;
//		}
//		TA531_LIN_SWS_G3.SWSCnfmSwReq_l = 	SW_BUTTON;
//		TA531_LIN_SWS_G3.SWSSelUpSwReq_l = 	SW_UP;
//		TA531_LIN_SWS_G3.SWSSelDwnSwReq_l = 	SW_DW;
//		TA531_LIN_SWS_G3.SWSSelLSwReq_l = 	SW_LEFT;
//		TA531_LIN_SWS_G3.SWSSelRSwReq_l = 	SW_RIGHT;

		if (temper_flag == 0) {
			SPI_Stop(Flash_SPI);
			HAL_Delay(5);
			SPI_TFT_Start(Flash_SPI);
			HAL_Delay(5);

			itoa(temp1075_ZXD_i, str1, 10);
			strcat(str1, ".");
			itoa(temp1075_ZXD_f, str2, 10);
			strncat(str1, str2, 1);
			lv_label_set_text(guider_ui.screen_label_Temp_ZXD, str1);
			lv_arc_set_value(guider_ui.screen_arc_TEMP_ZXD, temp1075_ZXD_i);

			itoa(temp1075_ZPD, str1, 10);
			lv_label_set_text(guider_ui.screen_label_Temp_ZPD, str1);
			lv_arc_set_value(guider_ui.screen_arc_TEMP_ZPD, temp1075_ZPD);

			itoa(temp1075_LHZCU, str1, 10);
			lv_label_set_text(guider_ui.screen_label_Temp_LHZCU, str1);
			lv_arc_set_value(guider_ui.screen_arc_TEMP_LHZCU, temp1075_LHZCU);

			itoa(temp1075_RHZCU, str1, 10);
			lv_label_set_text(guider_ui.screen_label_Temp_RHZCU, str1);
			lv_arc_set_value(guider_ui.screen_arc_TEMP_RHZCU, temp1075_RHZCU);

			itoa(temp1075_RZCU, str1, 10);
			lv_label_set_text(guider_ui.screen_label_Temp_RZCU, str1);
			lv_arc_set_value(guider_ui.screen_arc_TEMP_RZCU, temp1075_RZCU);

//			lvLED_Sts_TPRobot, lvLED_Sts_LIN, lvLED_Sts_CAN, lvLED_Sts_Sensor;
//			// 0 	GUI_GRAY,	1	GUI_GREEN,	2	GUI_ORANGE,	3	GUI_RED
//
//			lv_led_set_color(guider_ui.screen_led_TP, lv_color_hex(GUI_GRAY));
//			lv_led_set_color(guider_ui.screen_led_LIN, lv_color_hex(GUI_GREEN));
//			lv_led_set_color(guider_ui.screen_led_CAN, lv_color_hex(GUI_ORANGE));
//			lv_led_set_color(guider_ui.screen_led_Sensor, lv_color_hex(GUI_RED));

			switch (lvLED_Sts_TPRobot) {
			case 0:		//
				lv_led_set_color(guider_ui.screen_led_TP,
						lv_color_hex(GUI_GRAY));
				break;
			case 1:		//
				lv_led_set_color(guider_ui.screen_led_TP,
						lv_color_hex(GUI_GREEN));
				break;
			case 2:		//
				lv_led_set_color(guider_ui.screen_led_TP,
						lv_color_hex(GUI_ORANGE));
				break;
			case 3:		//
				lv_led_set_color(guider_ui.screen_led_TP,
						lv_color_hex(GUI_RED));
				break;
			}

			switch (lvLED_Sts_LIN) {
			case 0:		//
				lv_led_set_color(guider_ui.screen_led_LIN,
						lv_color_hex(GUI_GRAY));
				break;
			case 1:		//
				lv_led_set_color(guider_ui.screen_led_LIN,
						lv_color_hex(GUI_GREEN));
				break;
			case 2:		//
				lv_led_set_color(guider_ui.screen_led_LIN,
						lv_color_hex(GUI_ORANGE));
				break;
			case 3:		//
				lv_led_set_color(guider_ui.screen_led_LIN,
						lv_color_hex(GUI_RED));
				break;
			}

			switch (lvLED_Sts_CAN) {
			case 0:		//
				lv_led_set_color(guider_ui.screen_led_CAN,
						lv_color_hex(GUI_GRAY));
				break;
			case 1:		//
				lv_led_set_color(guider_ui.screen_led_CAN,
						lv_color_hex(GUI_GREEN));
				break;
			case 2:		//
				lv_led_set_color(guider_ui.screen_led_CAN,
						lv_color_hex(GUI_ORANGE));
				break;
			case 3:		//
				lv_led_set_color(guider_ui.screen_led_CAN,
						lv_color_hex(GUI_RED));
				break;
			}

			switch (lvLED_Sts_Sensor) {
			case 0:		//
				lv_led_set_color(guider_ui.screen_led_Sensor,
						lv_color_hex(GUI_GRAY));
				break;
			case 1:		//
				lv_led_set_color(guider_ui.screen_led_Sensor,
						lv_color_hex(GUI_GREEN));
				break;
			case 2:		//
				lv_led_set_color(guider_ui.screen_led_Sensor,
						lv_color_hex(GUI_ORANGE));
				break;
			case 3:		//
				lv_led_set_color(guider_ui.screen_led_Sensor,
						lv_color_hex(GUI_RED));
				break;
			}

			lv_task_handler();
			HAL_Delay(1);
//			SPI_Stop(Flash_SPI);
//			HAL_Delay(5);

		} else	//(temper_flag == 1)
		{
			//float temp1075_ZXD , temp1075_IPD , temp1075_LHZCU , temp1075_RHZCU , temp1075_RZCU , temp1075_Bk1 , temp1075_Bk2 , temp1075_Bk3;
			temp1075_ZXD = readTemperature(temp1075_ch, TempSensor_ADDR_ZXD);
			temp1075_ZPD = readTemperature(temp1075_ch, TempSensor_ADDR_ZPD);
			temp1075_LHZCU = readTemperature(temp1075_ch,
			TempSensor_ADDR_LHZCU);
			temp1075_RHZCU = readTemperature(temp1075_ch,
			TempSensor_ADDR_RHZCU);
			temp1075_RZCU = readTemperature(temp1075_ch, TempSensor_ADDR_RZCU);

			if (temp1075_ZXD < 10) {
				lvLED_Sts_Sensor = 0;
			} else if ((temp1075_ZXD < 50) & (temp1075_ZPD < 50)) {
				lvLED_Sts_Sensor = 1;
			} else if ((temp1075_ZXD < 75) & (temp1075_ZPD < 75)) {
				lvLED_Sts_Sensor = 2;
			} else {
				lvLED_Sts_Sensor = 3;
			}

			temp1075_ZXD_i = truncf(temp1075_ZXD);
			temp1075_ZXD_f = (temp1075_ZXD - temp1075_ZXD_i) * 100;

//			itoa(temp1075_ZXD_i,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,0, 2, str1);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,2, 2, ".");
//			itoa(temp1075_ZXD_f,str1,10);
//			OLED_ShowString(OLED_I2C_ch ,OLED_type,3, 2, str1);

