YanqiS/stm32temp1/main.c
			temper_flag = 0;
		}
		if (id1 == 1)  // MoC模式下显示
				{
			OLED_UpdatePage_Id1(oled_line);
		}
		// =======================================
	}  //while

	/* USER CODE END WHILE */

	/* USER CODE BEGIN 3 */

	/* USER CODE END 3 */
}

/* ====================== 可交接功能函数实现（中文） ======================
 * 目的：把易改需求（Flash开机策略/OLED显示策略）拆成独立函数，便于交接维护。
 */
#if CFG_BOOT_FLASH_SELF_TEST_EN
static void Boot_RunFlashSelfTest_AndLoadUID(char *str_buf) {
	uint8_t temp1[4], temp2[4];
	uint64_t UID;

	temp1[0] = 123;
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test");

	SPI_Flash_Start(Flash_SPI);
	HAL_Delay(5);
	SPI_Flash_WtritEnable();
	HAL_Delay(5);
	SPI_Flash_WriteSomeBytes(temp1, Sys_Addr_DispTest, sizeof(int));
	HAL_Delay(5);
	SPI_Flash_ReadBytes(temp2, Sys_Addr_DispTest, sizeof(int));

	while (temp1[0] != temp2[0]) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test Err..");
		SPI_Stop(Flash_SPI);
		HAL_Delay(5);
		SPI_Flash_Start(Flash_SPI);
		HAL_Delay(5);
		SPI_Flash_WriteSomeBytes(temp1, Sys_Addr_DispTest, sizeof(int));
		HAL_Delay(5);
		SPI_Flash_ReadBytes(temp2, Sys_Addr_DispTest, sizeof(int));

		itoa(temp1[0], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str_buf);
		itoa(temp1[1], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 2, str_buf);
		itoa(temp2[0], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, str_buf);
		itoa(temp2[1], str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 12, 2, str_buf);
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Flash Test OK!");
	HAL_Delay(1000);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "UniqID:");
	HAL_Delay(1);
	UID = SPI_Flash_GUID();
	SPI_Stop(Flash_SPI);

	if ((UID == 0) | ((UID & 0xffff) == 0xffff)) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 1, "Error! ");
		EncrypKey = 0x36;
	} else {
		itoa(UID, str_buf, 16);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 1, str_buf);
		EncrypKey = UID & 0xff;
	}
	HAL_Delay(500);
}
#else
static void Boot_SkipFlashSelfTest(void) {
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Skip Flash Test ");
	EncrypKey = 0x36;
	HAL_Delay(200);
}
#endif

static void OLED_ShowRIDFlagsLine(uint8_t row, char *oled_line) {
	snprintf(oled_line, 17, "22:%02u34:%02uI:%02X",
			(unsigned int) (DEBUG_RID22_Count % 100),
			(unsigned int) (DEBUG_RID34_Count % 100),
			(unsigned int) DEBUG_ReceiveID);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, row, oled_line);
}

static void OLED_UpdatePage_Id0(char *oled_line) {
	snprintf(oled_line, 17, "L1:%3d L2:%3d", TA531SysEnv.TA531_env_LightA1,
			TA531SysEnv.TA531_env_LightA2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, oled_line);

	snprintf(oled_line, 17, "L3:%3d L4:%3d", TA531SysEnv.TA531_env_LightA3,
			TA531SysEnv.TA531_env_LightA4);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, oled_line);

#if CFG_OLED_SHOW_RID_FLAGS_EN
	/* A 版本：第4行显示 LIN RID 收包状态，方便联调 */
	OLED_ShowRIDFlagsLine(3, oled_line);
#else
	/* B 版本：第4行显示传统 A1/A2（不看 RID） */
	snprintf(oled_line, 17, "A1:%3d A2:%3d", TA531SysEnv.TA531_env_ADC1,
			TA531SysEnv.TA531_env_ADC2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, oled_line);
#endif
}

static void OLED_UpdatePage_Id1(char *oled_line) {
	// 行0显示“当前/设置上限(X1Y1)”：最大值使用已设置的 X1/Y1，而不是固定 XmaxLimit/YmaxLimit
	snprintf(oled_line, 17, "X%3d/%3dY%3d/%3d", TA531_RC1.TA531_RC_X_act,
			ScreenSz_1.DispX1_32b, TA531_RC1.TA531_RC_Y_act, ScreenSz_1.DispY1_32b);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, oled_line);

	snprintf(oled_line, 17, "L1:%3d L2:%3d", TA531SysEnv.TA531_env_LightA1,
			TA531SysEnv.TA531_env_LightA2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, oled_line);

	snprintf(oled_line, 17, "A1:%3d A2:%3d", TA531SysEnv.TA531_env_ADC1,
			TA531SysEnv.TA531_env_ADC2);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, oled_line);

#if CFG_OLED_SHOW_RID_FLAGS_EN
	/* A 版本：第4行显示 LIN RID 收包状态，方便联调 */
	OLED_ShowRIDFlagsLine(3, oled_line);
#else
	/* B 版本：保留空白，避免遮挡 MoC 调试显示 */
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "                ");
#endif
}

static void Lin_RearmUart1(void) {
	LIN_RESET(&huart1);
	HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
}

static bool Lin_HandleKnownRid(uint8_t rid) {
	/* 表驱动分发：新增 RID 时，只需在这里追加一行映射 */
	typedef void (*LinRidHandler_t)(void);
	typedef struct {
		uint8_t rid;
		LinRidHandler_t handler;
	} LinRidDispatchItem;

	static const LinRidDispatchItem dispatch_table[] = { { 0x22, Lin_HandleRid22 },
			{ 0x34, Lin_HandleRid34 }, { 0x35, Lin_HandleRid35 }, { 0x36,
					Lin_HandleRid36 } };

	for (uint8_t i = 0; i < (sizeof(dispatch_table) / sizeof(dispatch_table[0]));
			i++) {
		if (dispatch_table[i].rid == rid) {
			dispatch_table[i].handler();
			return true;
		}
	}
	return false;
}

// 输入: rid=0x22，输出: 发送 SWS_0x22_Data；副作用: 清 SWS_0x22_Flag、重启LIN接收
static void Lin_HandleRid22(void) {
	DEBUG_LIN_Send_Count++;
	Lin_SendData(SWS_0x22_Data);
	SWS_0x22_Flag = 0;
	DataProcess = 0;
	Lin_RearmUart1();
}

// 输入: rid=0x34，输出: 发送 EBS_0x0_Data；副作用: 重启LIN接收
static void Lin_HandleRid34(void) {
	DEBUG_LIN_Send_Count++;
	Lin_SendData(EBS_0x0_Data);
	DataProcess = 0;
	Lin_RearmUart1();
}

// 输入: rid=0x35，输出: 发送 EBS_0x1_Data；副作用: 重启LIN接收
static void Lin_HandleRid35(void) {
	DEBUG_LIN_Send_Count++;
	Build_EBS_0x35_Data();
	Lin_SendData(EBS_0x1_Data);
	DataProcess = 0;
	Lin_RearmUart1();
}

// 输入: rid=0x36，输出: 发送 EBS_0x2_Data；副作用: 重启LIN接收
static void Lin_HandleRid36(void) {
	DEBUG_LIN_Send_Count++;
	Build_EBS_0x36_Data();
	Lin_SendData(EBS_0x2_Data);
	DataProcess = 0;
	Lin_RearmUart1();
}

// 输入: u1RxData/LIN_Data_LENGTH，输出: 更新 ReceiveData/RxData
static void Lin_ReadRxDataFromUart1(void) {
	if (LIN_Data_LENGTH == 1) {
		ReceiveData = u1RxData[0];
	} else {
		for (int i = 0; i < LIN_Data_LENGTH; i++) {
			RxData[i] = u1RxData[i];
		}
		ReceiveData = u1RxData[0];
	}
}

// 输入: ReceiveData，输出: 更新 ReceivePID/ReceiveID 和 DEBUG 统计
static void Lin_UpdateDebugOnRx(void) {
	ReceivePID = ReceiveData;
	ReceiveID = ReceivePID & 0x3f;
	DEBUG_ReceivePID = ReceivePID;

	DEBUG_UART_RX_Count++;
	DEBUG_ReceiveID = ReceiveID;
	DEBUG_DataProcess = DataProcess;
	if (ReceiveID == 0x22) {
		DEBUG_RID22_Count++;
	} else if (ReceiveID == 0x34) {
		DEBUG_RID34_Count++;
	}
}

static void Lin_HandleUnknownRid(void) {
	DataReceiveflag = 1;
	DataProcess = 2;
	Lin_RearmUart1();
}

static void Uart_RearmByHandle(UART_HandleTypeDef *huart) {
	if (huart == &huart1) {
		HAL_UART_Receive_IT(&huart1, u1RxData, LIN_Data_LENGTH);
	} else if (huart == &huart2) {
		HAL_UART_Receive_IT(&huart2, u2RxData, LIN_Data_LENGTH);
	} else if (huart == &huart3) {
		HAL_UART_Receive_IT(&huart3, u3RxData, LIN_Data_LENGTH);
	}
}

static void Can1_SendActionDoneAck(void) {
	memset(TSA_ActionDone_DATA, 0, sizeof(TSA_ActionDone_DATA));
	TSA_ActionDone_DATA[0] = 1;
	HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_ActionDone_Header,
			TSA_ActionDone_DATA);
}

