YanqiS/stm32temp1/main.c
	/* USER CODE END USART2_Init 2 */

}

/**
 * @brief USART3 Initialization Function
 * @param None
 * @retval None
 */
static void MX_USART3_UART_Init(void) {

	/* USER CODE BEGIN USART3_Init 0 */

	/* USER CODE END USART3_Init 0 */

	/* USER CODE BEGIN USART3_Init 1 */

	/* USER CODE END USART3_Init 1 */
	huart3.Instance = USART3;
	huart3.Init.BaudRate = 115200;
	huart3.Init.WordLength = UART_WORDLENGTH_8B;
	huart3.Init.StopBits = UART_STOPBITS_1;
	huart3.Init.Parity = UART_PARITY_NONE;
	huart3.Init.Mode = UART_MODE_TX_RX;
	huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart3.Init.OverSampling = UART_OVERSAMPLING_16;
	huart3.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
	huart3.Init.ClockPrescaler = UART_PRESCALER_DIV1;
	huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
	if (HAL_LIN_Init(&huart3, UART_LINBREAKDETECTLENGTH_10B) != HAL_OK) {
		Error_Handler();
	}
	if (HAL_UARTEx_SetTxFifoThreshold(&huart3, UART_TXFIFO_THRESHOLD_1_8)
			!= HAL_OK) {
		Error_Handler();
	}
	if (HAL_UARTEx_SetRxFifoThreshold(&huart3, UART_RXFIFO_THRESHOLD_1_8)
			!= HAL_OK) {
		Error_Handler();
	}
	if (HAL_UARTEx_DisableFifoMode(&huart3) != HAL_OK) {
		Error_Handler();
	}
	/* USER CODE BEGIN USART3_Init 2 */

	/* USER CODE END USART3_Init 2 */

}

/**
 * Enable DMA controller clock
 */
static void MX_DMA_Init(void) {

	/* DMA controller clock enable */
	__HAL_RCC_DMA1_CLK_ENABLE();

	/* DMA interrupt init */
	/* DMA1_Channel1_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
	/* DMA1_Channel2_3_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);

}

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPIO_Init(void) {
	GPIO_InitTypeDef GPIO_InitStruct = { 0 };
	/* USER CODE BEGIN MX_GPIO_Init_1 */
	/* USER CODE END MX_GPIO_Init_1 */

	/* GPIO Ports Clock Enable */
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOF_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOC,
	DOOR_RELAY_HSD1_Pin | DOOR_RELAY_HSD2_Pin | Y_RELAY_1_Pin | Y_RELAY_2_Pin,
			GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOE,
			DOOR_RELAY_HSD3_Pin | DOOR_RELAY_HSD4_Pin | COM_RELAY_1_Pin
					| COM_RELAY_2_Pin | COM_RELAY_3_Pin | LIN_RELAY_Pin
					| SPI_Flash_NSS_Pin | SPI_TFT_NSS_Pin | IO_SYS_LED_B_Pin
					| IO_SYS_LED_G_Pin | IO_SYS_LED_R_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOF,
			ST7789_DC_Pin | USB_RELAY_1_Pin | USB_RELAY_2_Pin | Y_RELAY_6_Pin
					| KL15_RELAY_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOA, Y_RELAY_3_Pin | Y_RELAY_4_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(GPIOD,
	LIN3_EN_Pin | Eshft_RELAY_Pin | LIN1_EN_Pin | LIN2_EN_Pin, GPIO_PIN_RESET);

	/*Configure GPIO pins : DOOR_RELAY_HSD1_Pin DOOR_RELAY_HSD2_Pin */
	GPIO_InitStruct.Pin = DOOR_RELAY_HSD1_Pin | DOOR_RELAY_HSD2_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_PULLDOWN;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	/*Configure GPIO pins : DOOR_RELAY_HSD3_Pin DOOR_RELAY_HSD4_Pin */
	GPIO_InitStruct.Pin = DOOR_RELAY_HSD3_Pin | DOOR_RELAY_HSD4_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_PULLDOWN;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

	/*Configure GPIO pin : XL9555_1_INT_Pin */
	GPIO_InitStruct.Pin = XL9555_1_INT_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(XL9555_1_INT_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pin : XL9555_2_INT_Pin */
	GPIO_InitStruct.Pin = XL9555_2_INT_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(XL9555_2_INT_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pin : ST7789_DC_Pin */
	GPIO_InitStruct.Pin = ST7789_DC_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(ST7789_DC_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pins : USB_RELAY_1_Pin USB_RELAY_2_Pin Y_RELAY_6_Pin KL15_RELAY_Pin */
	GPIO_InitStruct.Pin = USB_RELAY_1_Pin | USB_RELAY_2_Pin | Y_RELAY_6_Pin
			| KL15_RELAY_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

	/*Configure GPIO pins : Y_RELAY_1_Pin Y_RELAY_2_Pin */
	GPIO_InitStruct.Pin = Y_RELAY_1_Pin | Y_RELAY_2_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	/*Configure GPIO pins : Y_RELAY_3_Pin Y_RELAY_4_Pin */
	GPIO_InitStruct.Pin = Y_RELAY_3_Pin | Y_RELAY_4_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/*Configure GPIO pin : Y_RELAY_5_Pin */
	GPIO_InitStruct.Pin = Y_RELAY_5_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(Y_RELAY_5_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pins : COM_RELAY_1_Pin COM_RELAY_2_Pin COM_RELAY_3_Pin LIN_RELAY_Pin
	 SPI_Flash_NSS_Pin SPI_TFT_NSS_Pin */
	GPIO_InitStruct.Pin = COM_RELAY_1_Pin | COM_RELAY_2_Pin | COM_RELAY_3_Pin
			| LIN_RELAY_Pin | SPI_Flash_NSS_Pin | SPI_TFT_NSS_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

	/*Configure GPIO pins : LIN3_EN_Pin Eshft_RELAY_Pin LIN1_EN_Pin LIN2_EN_Pin */
	GPIO_InitStruct.Pin = LIN3_EN_Pin | Eshft_RELAY_Pin | LIN1_EN_Pin
			| LIN2_EN_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

	/*Configure GPIO pins : LIN3_NRES_Pin IO_CFG_2_Pin IO_CFG_3_Pin IO_CFG_4_Pin */
	GPIO_InitStruct.Pin = LIN3_NRES_Pin | IO_CFG_2_Pin | IO_CFG_3_Pin
			| IO_CFG_4_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

	/*Configure GPIO pin : LIN1_NRES_Pin */
	GPIO_InitStruct.Pin = LIN1_NRES_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(LIN1_NRES_GPIO_Port, &GPIO_InitStruct);

