YanqiS/stm32temp1/main.c
					TA531_LIN_SWS.LIN_SWS_SWSLFnChngSwA_1 = (buf_rec[5] >> 0)
							& 0x01;
					TA531_LIN_SWS.LIN_SWS_050ms_PDU00_Reserve03_7 = (buf_rec[5]
							>> 1) & 0x7f;

					TSA_Ack_DATA[5] = 1;
					TSA4_0x103_Flag = 1;
					lvLED_Sts_LIN = 2;
				} else if (FDCAN1_RxHeader.Identifier == 0x104)	//TSA_LIN_SWS G3.0
						{
					// 解析CAN数据

					TA531_LIN_SWS_G3.CCSwStsAlvRC_l = (buf_rec[1] >> 0) & 0x0f;
					TA531_LIN_SWS_G3.SWSSelUpSwAL_l = (buf_rec[1] >> 4) & 0x03;
					TA531_LIN_SWS_G3.SWSSelDwnSwAL_l = (buf_rec[1] >> 6) & 0x03;

					DEBUG_CAN_Up = TA531_LIN_SWS_G3.SWSSelUpSwAL_l;
					DEBUG_CAN_Down = TA531_LIN_SWS_G3.SWSSelDwnSwAL_l;
					DEBUG_CAN_RX_Flag = 1;  // 标记收到新数据
					DEBUG_CAN_104_Count++;

					TA531_LIN_SWS_G3.SWSSelLSwAL_l = (buf_rec[2] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSSelRSwAL_l = (buf_rec[2] >> 2) & 0x03;
					TA531_LIN_SWS_G3.SWSCnfmSwAL_l = (buf_rec[2] >> 4) & 0x03;
					TA531_LIN_SWS_G3.SWSPB1SwAL_l = (buf_rec[2] >> 6) & 0x03;

					TA531_LIN_SWS_G3.SWSPB2SwAL_l = (buf_rec[3] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSPB3SwAL_l = (buf_rec[3] >> 2) & 0x03;
					TA531_LIN_SWS_G3.SWSSelUpSwReq_l = (buf_rec[3] >> 4) & 0x03;
					TA531_LIN_SWS_G3.SWSSelDwnSwReq_l = (buf_rec[3] >> 6)
							& 0x03;

					TA531_LIN_SWS_G3.SWSSelLSwReq_l = (buf_rec[4] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSSelRSwReq_l = (buf_rec[4] >> 2) & 0x03;
					TA531_LIN_SWS_G3.SWSCnfmSwReq_l = (buf_rec[4] >> 4) & 0x03;
					TA531_LIN_SWS_G3.SWSPB1SwReq_l = (buf_rec[4] >> 6) & 0x03;

					TA531_LIN_SWS_G3.SWSPB2SwReq_l = (buf_rec[5] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSPB3SwReq_l = (buf_rec[5] >> 2) & 0x03;
					TA531_LIN_SWS_G3.PfTrTapUpDwnSecySwSta_l = (buf_rec[5] >> 4)
							& 0x03;
					TA531_LIN_SWS_G3.PadSSelLSwA_l = (buf_rec[5] >> 6) & 0x03;

					TA531_LIN_SWS_G3.PadSSelRSwA_l = (buf_rec[6] >> 0) & 0x03;
					TA531_LIN_SWS_G3.SWSSelLSwStuckL_l = (buf_rec[6] >> 2)
							& 0x01;
					TA531_LIN_SWS_G3.SWSSelRSwStuckL_l = (buf_rec[6] >> 3)
							& 0x01;
					TA531_LIN_SWS_G3.SWSCnfmSwStuckL_l = (buf_rec[6] >> 4)
							& 0x01;
					TA531_LIN_SWS_G3.SWSPB1SwStuckL_l = (buf_rec[6] >> 5)
							& 0x01;
					TA531_LIN_SWS_G3.SWSPB2SwStuckL_l = (buf_rec[6] >> 6)
							& 0x01;
					TA531_LIN_SWS_G3.SWSPB3SwStuckL_l = (buf_rec[6] >> 7)
							& 0x01;

					TA531_LIN_SWS_G3.StrgWhlEntrtnSwDataIntgty_l = (buf_rec[7]
							>> 0) & 0x01;  // 新增
					TA531_LIN_SWS_G3.StrgWhlDrvngMdSwA_l = (buf_rec[7] >> 1)
							& 0x01;
					TA531_LIN_SWS_G3.StrgWhlDrvngMdSwDataIntgty_l = (buf_rec[7]
							>> 2) & 0x01;
					TA531_LIN_SWS_G3.StrgWhlTipcSwDataIntgty_l = (buf_rec[7]
							>> 3) & 0x01;
					TA531_LIN_SWS_G3.PadSSelLSwStuck_l = (buf_rec[7] >> 4)
							& 0x01;
					TA531_LIN_SWS_G3.PadSSelRSwStuck_l = (buf_rec[7] >> 5)
							& 0x01;
					TA531_LIN_SWS_G3.RespErSWSF_l = (buf_rec[7] >> 6) & 0x01;

					TSA_Ack_DATA[5] = 1;
					TSA4_0x104_Flag = 1;
					lvLED_Sts_LIN = 2;
				} else if (FDCAN1_RxHeader.Identifier == 0x105)	//EBS LIN FrP00 bridge
						{
					EBSBatVol_raw = (uint16_t) (((uint16_t) buf_rec[1] << 8) | buf_rec[0]) & 0x3FFF;
					EBSVolSts_raw = buf_rec[2] & 0x03;
					EBSBatCrntRng_raw = buf_rec[3] & 0x03;
					EBSBatIncnstncyFlag_raw = buf_rec[4] & 0x01;
					EBSRespEr_raw = buf_rec[5] & 0x01;
					TSA_Ack_DATA[6] = 1;
					lvLED_Sts_LIN = 2;
					} else if (FDCAN1_RxHeader.Identifier == 0x064)	//TSA_RC1 mm
							{
						g_rc1_last_cmd_id = 0x064;
						g_rc1_x_mov_raw = buf_rec[2];
						g_rc1_y_mov_raw = buf_rec[5];
						int rx_x_mm = (int) ((buf_rec[1] << 8) + (buf_rec[0] << 0));
						int rx_y_mm = (int) ((buf_rec[4] << 8) + (buf_rec[3] << 0));

					TA531_RC1.TA531_RC_Reset = (buf_rec[7] >> 6) & 0x03;
					// 以屏幕左上角(X0,Y0)作为逻辑0点：
					// Python发(0,0) => 物理到(X0,Y0)，发(69,41) => 到(X0+69, Y0+41)
					if ((TA531_RC1.TA531_RC_Reset == 1)
							&& (rx_x_mm == 0)
							&& (rx_y_mm == 0)) {
						// Reset 命令保留绝对零点语义（回机械零）
						TA531_RC1.TA531_RC_X_trg = 0;
						TA531_RC1.TA531_RC_Y_trg = 0;
					} else {
							TA531_RC1.TA531_RC_X_trg = ScreenSz_1.DispX0_32b + rx_y_mm;
							TA531_RC1.TA531_RC_Y_trg = ScreenSz_1.DispY0_32b + rx_x_mm;
						}
							TA531_RC1.TA531_RC_X_Mov = (int8_t) buf_rec[5];
							TA531_RC1.TA531_RC_Y_Mov = (int8_t) buf_rec[2];

					TA531_RC1.TA531_RC_Z = (int) (buf_rec[6] << 0);
					TA531_RC1.TA531_RC_Z_code = buf_rec[7] & 0x03;

						if (!Position_InBounds(TA531_RC1.TA531_RC_X_trg,
								TA531_RC1.TA531_RC_Y_trg,
								(TA531_RC1.TA531_RC_Reset == 1))) {
							// 越界命令：不执行，蜂鸣提示
							Sys_tuneShort();
							TA531_RC1_fg = 1;
						} else {
							TA531_RC1_fg = 2;
						}
					} else if (FDCAN1_RxHeader.Identifier == 0x065)	//TSA_RC1p %
							{
						g_rc1_last_cmd_id = 0x065;
							g_rc1_x_mov_raw = buf_rec[5];
							g_rc1_y_mov_raw = buf_rec[2];
						uint8_t id4_now = (uint8_t) HAL_GPIO_ReadPin(
						IO_CFG_4_GPIO_Port, IO_CFG_4_Pin);
						// 运行时实时读取 id4，避免切换后必须重启
						Mode_ID = (Mode_ID & 0x0E) | (id4_now & 0x01);
						uint8_t scale_den = (id4_now == 0) ? 100 : 255;
						uint8_t x_pct_raw = buf_rec[0];
						uint8_t y_pct_raw = buf_rec[3];

						// id4=0 时走百分比(0~100)语义，避免 100 不能到 X1/Y1
						if (scale_den == 100) {
							if (x_pct_raw > 100) {
								x_pct_raw = 100;
							}
							if (y_pct_raw > 100) {
								y_pct_raw = 100;
							}
						}

						TA531_RC1.TA531_RC_Reset = (buf_rec[7] >> 6) & 0x03;
						if ((TA531_RC1.TA531_RC_Reset == 1)
								&& (buf_rec[0] == 0)
							&& (buf_rec[3] == 0)) {
						// Reset 命令保留绝对零点语义（回机械零）
						TA531_RC1.TA531_RC_X_trg = 0;
						TA531_RC1.TA531_RC_Y_trg = 0;
						} else {
							// 百分比命令以屏幕区域左上角(X0,Y0)作为逻辑0点
							// id4=0 => 按 /100 映射；id4=1 => 兼容旧版 /255 映射
								TA531_RC1.TA531_RC_X_trg = ScreenSz_1.DispX0_32b
										+ (int) (y_pct_raw
												* (ScreenSz_1.DispX1_32b
														- ScreenSz_1.DispX0_32b) / scale_den);
								TA531_RC1.TA531_RC_Y_trg = ScreenSz_1.DispY0_32b
										+ (int) (x_pct_raw
												* (ScreenSz_1.DispY1_32b
														- ScreenSz_1.DispY0_32b) / scale_den);
							}

