YanqiS/stm32temp1/main.c
	}
	if (htim == &htim14)	//1000ms
			{

		//TA531 Ack
		TSA_Ack_DATA[0] = 0x64;	//100
		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_Ack_Header, TSA_Ack_DATA);
		TSA_Ack_DATA[0] = 0;

		Sys_CNT++;

		uint32_t value_ADC1_0;
		value_ADC1_0 = mRead_ADC1_ch(1);
		if (value_ADC1_0 < 4500) {
			Bench_Info.Bench_PowerSts = 0;
		} else if (value_ADC1_0 < 9000) {
			Bench_Info.Bench_PowerSts = 1;
			Sys_RunCNT++;
		} else if (value_ADC1_0 < 13500) {
			Bench_Info.Bench_PowerSts = 2;
			Sys_RunCNT++;
		} else {
			Bench_Info.Bench_PowerSts = 3;
			Sys_RunCNT++;
		}

///////// XL9555
		uint8_t XL9555_tempdata;
		XL9555_tempdata = XL9555_Read(XL9555_1_addr_read, 0);
		TA531_GP_IN.GP_IN_1_1 = !((XL9555_tempdata >> 0) & 0x01);
		TA531_GP_IN.GP_IN_1_2 = !((XL9555_tempdata >> 1) & 0x01);
		TA531_GP_IN.GP_IN_1_3 = !((XL9555_tempdata >> 2) & 0x01);
		TA531_GP_IN.GP_IN_1_4 = !((XL9555_tempdata >> 3) & 0x01);
		TA531_GP_IN.GP_IN_1_5 = !((XL9555_tempdata >> 4) & 0x01);
		TA531_GP_IN.GP_IN_1_6 = !((XL9555_tempdata >> 5) & 0x01);
		TA531_GP_IN.GP_IN_1_7 = !((XL9555_tempdata >> 6) & 0x01);
		TA531_GP_IN.GP_IN_1_8 = !((XL9555_tempdata >> 7) & 0x01);

		XL9555_tempdata = XL9555_Read(XL9555_1_addr_read, 1);
		TA531_GP_IN.GP_IN_2_8 = !((XL9555_tempdata >> 0) & 0x01);
		TA531_GP_IN.GP_IN_2_7 = !((XL9555_tempdata >> 1) & 0x01);
		TA531_GP_IN.GP_IN_2_6 = !((XL9555_tempdata >> 2) & 0x01);
		TA531_GP_IN.GP_IN_2_5 = !((XL9555_tempdata >> 3) & 0x01);
		TA531_GP_IN.GP_IN_2_4 = !((XL9555_tempdata >> 4) & 0x01);
		TA531_GP_IN.GP_IN_2_3 = !((XL9555_tempdata >> 5) & 0x01);
		TA531_GP_IN.GP_IN_2_2 = !((XL9555_tempdata >> 6) & 0x01);
		TA531_GP_IN.GP_IN_2_1 = !((XL9555_tempdata >> 7) & 0x01);

		XL9555_tempdata = XL9555_Read(XL9555_2_addr_read, 0);
		TA531_GP_IN.GP_IN_3_1 = !((XL9555_tempdata >> 0) & 0x01);
		TA531_GP_IN.GP_IN_3_2 = !((XL9555_tempdata >> 1) & 0x01);
		TA531_GP_IN.GP_IN_3_3 = !((XL9555_tempdata >> 2) & 0x01);
		TA531_GP_IN.GP_IN_3_4 = !((XL9555_tempdata >> 3) & 0x01);
		TA531_GP_IN.GP_IN_3_5 = !((XL9555_tempdata >> 4) & 0x01);
		TA531_GP_IN.GP_IN_3_6 = !((XL9555_tempdata >> 5) & 0x01);
		TA531_GP_IN.GP_IN_3_7 = !((XL9555_tempdata >> 6) & 0x01);
		TA531_GP_IN.GP_IN_3_8 = !((XL9555_tempdata >> 7) & 0x01);

		XL9555_tempdata = XL9555_Read(XL9555_2_addr_read, 1);
		TA531_GP_IN.GP_IN_4_8 = !((XL9555_tempdata >> 0) & 0x01);
		TA531_GP_IN.GP_IN_4_7 = !((XL9555_tempdata >> 1) & 0x01);
		TA531_GP_IN.GP_IN_4_6 = !((XL9555_tempdata >> 2) & 0x01);
		TA531_GP_IN.GP_IN_4_5 = !((XL9555_tempdata >> 3) & 0x01);
		TA531_GP_IN.GP_IN_4_4 = !((XL9555_tempdata >> 4) & 0x01);
		TA531_GP_IN.GP_IN_4_3 = !((XL9555_tempdata >> 5) & 0x01);
		TA531_GP_IN.GP_IN_4_2 = !((XL9555_tempdata >> 6) & 0x01);
		TA531_GP_IN.GP_IN_4_1 = !((XL9555_tempdata >> 7) & 0x01);

		TSA_GP_IN_DATA[0] = ((TA531_GP_IN.GP_IN_1_1 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_1_2 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_1_3 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_1_4 & 0x03) << 6);
		TSA_GP_IN_DATA[1] = ((TA531_GP_IN.GP_IN_1_5 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_1_6 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_1_7 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_1_8 & 0x03) << 6);
		TSA_GP_IN_DATA[2] = ((TA531_GP_IN.GP_IN_2_1 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_2_2 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_2_3 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_2_4 & 0x03) << 6);
		TSA_GP_IN_DATA[3] = ((TA531_GP_IN.GP_IN_2_5 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_2_6 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_2_7 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_2_8 & 0x03) << 6);
		TSA_GP_IN_DATA[4] = ((TA531_GP_IN.GP_IN_3_1 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_3_2 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_3_3 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_3_4 & 0x03) << 6);
		TSA_GP_IN_DATA[5] = ((TA531_GP_IN.GP_IN_3_5 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_3_6 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_3_7 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_3_8 & 0x03) << 6);
		TSA_GP_IN_DATA[6] = ((TA531_GP_IN.GP_IN_4_1 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_4_2 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_4_3 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_4_4 & 0x03) << 6);
		TSA_GP_IN_DATA[7] = ((TA531_GP_IN.GP_IN_4_5 & 0x03) << 0)
				+ ((TA531_GP_IN.GP_IN_4_6 & 0x03) << 2)
				+ ((TA531_GP_IN.GP_IN_4_7 & 0x03) << 4)
				+ ((TA531_GP_IN.GP_IN_4_8 & 0x03) << 6);

		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_GP_IN_Header,
				TSA_GP_IN_DATA);

	}

	if (htim == &htim16)	//50ms
			{
		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA1_ADC_Header,
				TSA1_ADC_DATA);
		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA2_LS_Header, TSA2_LS_DATA);

		////for touchpen short/long time count
		Sys_TIM_TICK = Sys_TIM_TICK + 5;

		if (Sys_TIM_TICK > 0xFFFFFFF0) {
			Sys_TIM_TICK = 0;
		}
	}
	if (htim == &htim17)	//1ms
			{
		lv_tick_inc(1);
	}

}

uint8_t Lin_CheckPID(uint8_t id) {
	uint8_t returnpid;
	uint8_t P0;
	uint8_t P1;

	P0 = (((id) ^ (id >> 1) ^ (id >> 2) ^ (id >> 4)) & 0x01) << 6;
	P1 = ((~((id >> 1) ^ (id >> 3) ^ (id >> 4) ^ (id >> 5))) & 0x01) << 7;

	returnpid = id | P0 | P1;

	return returnpid;
}

uint8_t Lin_Checksum(uint8_t id, uint8_t *data) {
	uint8_t t;
	uint16_t sum = 0;
	bool is_diag_frame = (id == 0x3C) || (id == 0x3D);

	for (t = 0; t < 8; t++) {
		sum += data[t];
		if (sum & 0xff00) {
			sum = (sum & 0x00ff) + 1;
		}
	}

	if (!is_diag_frame) {
		sum += Lin_CheckPID(id);
		if (sum & 0xff00) {
			sum = (sum & 0x00ff) + 1;
		}
	}

	sum = ~sum;
	data[8] = (uint8_t) sum;
	return (uint8_t) sum;
}

uint8_t Calc_SWS_G3_CRC8(const uint8_t *data, uint8_t len) {
	uint8_t crc = 0x00;

	for (uint8_t i = 0; i < len; i++) {
		crc ^= data[i];
		for (uint8_t bit = 0; bit < 8; bit++) {
			if (crc & 0x80) {
				crc = (uint8_t) ((crc << 1) ^ 0x1D);
			} else {
				crc <<= 1;
			}
		}
	}

	return crc;
}

void Build_EBS_0x34_Data(void) {
	uint16_t v = EBSBatVol_raw & 0x3FFF;
	// EBSBatCrnt raw=0x8000 => 0x8000*0.0078125-256 = 0A (factor=0.0078125, offset=-256)
	uint16_t crnt = 0x8000;
	// EBSBatTem raw=65 => 65*1-40 = 25°C (factor=1, offset=-40)
	uint8_t tem = 65;

	memset(EBS_0x0_Data, 0, 9);

	// bit0..13: EBSBatVol_l (14bit)
	EBS_0x0_Data[0] = (uint8_t) (v & 0xFF);
	// bit8..13: EBSBatVol_l high, bit14..15: EBSBatCrntRng_l
	EBS_0x0_Data[1] = (uint8_t) (((v >> 8) & 0x3F) | ((EBSBatCrntRng_raw & 0x03) << 6));
	// bit16..31: EBSBatCrnt_l (16bit, little-endian)
	EBS_0x0_Data[2] = (uint8_t) (crnt & 0xFF);
	EBS_0x0_Data[3] = (uint8_t) ((crnt >> 8) & 0xFF);
	// bit32..39: EBSBatTem_l
	EBS_0x0_Data[4] = tem;
	// bit40..47: EBSQucntCrnt_l = 0
	EBS_0x0_Data[5] = 0;
	// bit48..49: EBSCrntSts_l=0 (No_error)
	// bit50..51: EBSVolSts_l
	// bit52..53: EBSTemSts_l=0 (No_error)
	// bit54:     EBSErInCalData_l=0
	// bit55:     EBSErInECUIdficn_l=0
	EBS_0x0_Data[6] = (uint8_t) ((EBSVolSts_raw & 0x03) << 2);
	// bit56:     EBSRespEr_l
	// bit57:     EBSBatIncnstncyFlag_l
	EBS_0x0_Data[7] = (uint8_t) ((EBSRespEr_raw & 0x01)
			| ((EBSBatIncnstncyFlag_raw & 0x01) << 1));
}

