YanqiS/stm32temp1/main.c
// EBS_ICCLIN1_FrP01_ICC_LIN1 (LIN ID 0x35): SOC, SOH, SOF signals
// Sends placeholder values to prevent LIN master timeout
void Build_EBS_0x35_Data(void) {
	memset(EBS_0x1_Data, 0, 9);
	// byte0: EBSSOC_l=0 (0%)
	// byte1: EBSSOHOfSlphtn_l=0
	// byte2: EBSBatSOFVol1_l=0
	// byte3: EBSBatSOFVol2_l=0
	// byte4: EBSSOHOfLAM_l=0
	// byte5: EBSSOHOfCrsn_l=0
	// byte6 bit2-3: EBSSOCSts_l=0 (deviation>15%, valid encoding)
	// byte6 bit4-5: EBSSOHOfSlphtnSts_l=0
	// byte6 bit6-7: EBSBatSOFVol1Sts_l=0
	// byte7 bit0-1: EBSBatSOFVol2Sts_l=0
	// byte7 bit2-3: EBSSOHOfLAMSts_l=0
	// byte7 bit4-5: EBSSOHOfCrsnSts_l=0
}

// EBS_ICCLIN1_FrP02_ICC_LIN1 (LIN ID 0x36): accumulated charge/discharge
// Sends placeholder values to prevent LIN master timeout
void Build_EBS_0x36_Data(void) {
	memset(EBS_0x2_Data, 0, 9);
	// byte0-1: EBSAcumtdBatChrg_l=0
	// byte2-3: EBSAcumtdBatDschrg_l=0
}

void Lin_SendData(uint8_t *data) {
	Lin_Checksum(ReceiveID, data);

	HAL_UART_Transmit_IT(&huart1, data, 9);

	lvLED_Sts_LIN = 1;
}

void Lin_DataProcess_loop(void)	//asap, if need to deal with LIN data; if not ,seems no use
{
	//// ========== 直接打包 SWS_0x22_Data，无条件执行（像main1_1.c一样）==========
	SWS_0x22_Data[1] = ((TA531_LIN_SWS_G3.CCSwStsAlvRC_l & 0x0f) << 0)
			+ ((TA531_LIN_SWS_G3.SWSSelUpSwAL_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.SWSSelDwnSwAL_l & 0x03) << 6);
	DEBUG_LIN_Byte1 = SWS_0x22_Data[1];
	DEBUG_LIN_Pack_Flag = 1;

	SWS_0x22_Data[2] = ((TA531_LIN_SWS_G3.SWSSelLSwAL_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSSelRSwAL_l & 0x03) << 2)
			+ ((TA531_LIN_SWS_G3.SWSCnfmSwAL_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.SWSPB1SwAL_l & 0x03) << 6);

	SWS_0x22_Data[3] = ((TA531_LIN_SWS_G3.SWSPB2SwAL_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSPB3SwAL_l & 0x03) << 2)
			+ ((TA531_LIN_SWS_G3.SWSSelUpSwReq_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.SWSSelDwnSwReq_l & 0x03) << 6);

	SWS_0x22_Data[4] = ((TA531_LIN_SWS_G3.SWSSelLSwReq_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSSelRSwReq_l & 0x03) << 2)
			+ ((TA531_LIN_SWS_G3.SWSCnfmSwReq_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.SWSPB1SwReq_l & 0x03) << 6);

	SWS_0x22_Data[5] = ((TA531_LIN_SWS_G3.SWSPB2SwReq_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSPB3SwReq_l & 0x03) << 2)
			+ ((TA531_LIN_SWS_G3.PfTrTapUpDwnSecySwSta_l & 0x03) << 4)
			+ ((TA531_LIN_SWS_G3.PadSSelLSwA_l & 0x03) << 6);

	SWS_0x22_Data[6] = ((TA531_LIN_SWS_G3.PadSSelRSwA_l & 0x03) << 0)
			+ ((TA531_LIN_SWS_G3.SWSSelLSwStuckL_l & 0x01) << 2)
			+ ((TA531_LIN_SWS_G3.SWSSelRSwStuckL_l & 0x01) << 3)
			+ ((TA531_LIN_SWS_G3.SWSCnfmSwStuckL_l & 0x01) << 4)
			+ ((TA531_LIN_SWS_G3.SWSPB1SwStuckL_l & 0x01) << 5)
			+ ((TA531_LIN_SWS_G3.SWSPB2SwStuckL_l & 0x01) << 6)
			+ ((TA531_LIN_SWS_G3.SWSPB3SwStuckL_l & 0x01) << 7);

	SWS_0x22_Data[7] = ((TA531_LIN_SWS_G3.StrgWhlEntrtnSwDataIntgty_l & 0x01)
			<< 0) + ((TA531_LIN_SWS_G3.StrgWhlDrvngMdSwA_l & 0x01) << 1)
			+ ((TA531_LIN_SWS_G3.StrgWhlDrvngMdSwDataIntgty_l & 0x01) << 2)
			+ ((TA531_LIN_SWS_G3.StrgWhlTipcSwDataIntgty_l & 0x01) << 3)
			+ ((TA531_LIN_SWS_G3.PadSSelLSwStuck_l & 0x01) << 4)
			+ ((TA531_LIN_SWS_G3.PadSSelRSwStuck_l & 0x01) << 5)
			+ ((TA531_LIN_SWS_G3.RespErSWSF_l & 0x01) << 6);

	SWS_0x22_Data[0] = Calc_SWS_G3_CRC8(&SWS_0x22_Data[1], 7);

	Lin_DataProcess_loop_ebs();

	//// ========== 处理接收到的LIN数据 ==========
	uint8_t PIDChecksum;
	uint8_t SumCheck;

	if (DataReceiveflag == 1) {
		ReceiveID = ReceivePID & 0x3f;
		PIDChecksum = Lin_CheckPID(ReceiveID);
		if (PIDChecksum != ReceivePID) {
			return;
		}

		if (FrameReceiveOverFlag == 1) {
			SumCheck = Lin_Checksum(ReceiveID, LinReceiveData);
			if (ReceiveCheckSum != SumCheck) {
				return;
			}

			if (ReceiveID == 0x23) {
				if (LinReceiveData[3] == 0x01) {
				} else if (LinReceiveData[3] == 0x02) {
				}
			}
		}
		FrameReceiveOverFlag = 0;
		DataReceiveflag = 0;
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart != &huart1) {
		Uart_RearmByHandle(huart);
		return;
	}
	Lin_ReadRxDataFromUart1();
	Lin_UpdateDebugOnRx();

	// 常见 RID 在独立函数内处理（包含计数、打包、发送、重启接收）
	if (Lin_HandleKnownRid(ReceiveID)) {
		return;
	}

	// 未识别 RID：进入后续通用流程
	Lin_HandleUnknownRid();
}

void UART_Init(UART_HandleTypeDef *handle, uint32_t data_length) {

	if (handle == &huart1) {
		HAL_UART_Receive_IT(&huart1, u1RxData, Serial_Data_LENGTH);	//
		return;
	}
	Uart_RearmByHandle(handle);

}

void UART_RESET(UART_HandleTypeDef *handle) {

	HAL_UART_AbortReceive(handle);
	HAL_UART_AbortReceive_IT(handle);
	/* Clear RXNE interrupt flag *//* Discard the received data */
	__HAL_UART_SEND_REQ(handle, UART_RXDATA_FLUSH_REQUEST);

}
//void CAN2Ser_Config(void)
//{
//
//}

uint32_t mRead_ADC1_ch(uint8_t ch) {
	//start ADC
	HAL_ADC_Start(&hadc1);

	HAL_ADC_PollForConversion(&hadc1, 500);

	if (ch == 1) {

	} else if (ch == 2)	//```6
			{

	}

//    if (HAL_IS_BIT_SET(HAL_ADC_GetState(&hadc1), HAL_ADC_STATE_REG_EOC))//读取ADC完成标志�?????????????????????????????????????????????????????????
//    {
//        adc_value = HAL_ADC_GetValue(&hadc1);//读出ADC数�??
//
//        // 将ADC值转换为电压
//        mVoltage = adc_value  *1165 /165 * 3250/ 4095; // 12位ADC，最�?????????????????????????????????????????????????????????4095
//    }

	// 停止ADC转换
	HAL_ADC_Stop(&hadc1);

	return mVoltage;
}

bool WaitMotorToTargetWithProtection(uint32_t timeout_ms, uint16_t poll_ms,
		bool trigger_emergency) {
	uint32_t start_tick = HAL_GetTick();

	while ((abs(TA531_RC1.TA531_RC_X_act - TA531_RC1.TA531_RC_X_trg)
			> REACH_POSITION_TOLERANCE)
			|| (abs(TA531_RC1.TA531_RC_Y_act - TA531_RC1.TA531_RC_Y_trg)
					> REACH_POSITION_TOLERANCE)) {
		MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);

		if (Motor_Protection_Check(TA531_RC1.TA531_RC_X_act,
				TA531_RC1.TA531_RC_Y_act, TA531_RC1.TA531_RC_X_trg,
				TA531_RC1.TA531_RC_Y_trg) != 0) {
			if (trigger_emergency) {
				Motor_Protection_EmergencyStop();
			}
			return false;
		}

		if ((HAL_GetTick() - start_tick) > timeout_ms) {
			Motor_Protection.protection_triggered = 1;
			Motor_Protection.error_type = 3;
			Motor_Protection.total_errors++;
			if (trigger_emergency) {
				Motor_Protection_EmergencyStop();
			}
			return false;
		}

		HAL_Delay(poll_ms);
	}

