YanqiS/stm32temp1/main.c
	return true;
}

// 开机/验证后移动：统一为与 CAN 控制一致的循环节奏
bool MoveToTarget_LikeSetXY(uint32_t timeout_ms) {
	uint32_t start_tick = HAL_GetTick();

	while ((abs(TA531_RC1.TA531_RC_X_act - TA531_RC1.TA531_RC_X_trg)
			> REACH_POSITION_TOLERANCE)
			|| (abs(TA531_RC1.TA531_RC_Y_act - TA531_RC1.TA531_RC_Y_trg)
					> REACH_POSITION_TOLERANCE)) {
		MotoCtrl_PositionLoop(TA531_RC1.TA531_RC_X_trg, TA531_RC1.TA531_RC_Y_trg);
		HAL_Delay(MOTOR_LOOP_INTERVAL_MS);  // 与 CAN 控制主循环一致

		if (Motor_Protection_Check(TA531_RC1.TA531_RC_X_act,
				TA531_RC1.TA531_RC_Y_act, TA531_RC1.TA531_RC_X_trg,
				TA531_RC1.TA531_RC_Y_trg) != 0) {
			Motor_Protection_EmergencyStop();
			return false;
		}

		if ((HAL_GetTick() - start_tick) > timeout_ms) {
			Motor_Protection.protection_triggered = 1;
			Motor_Protection.error_type = 3;
			Motor_Protection.total_errors++;
			Motor_Protection_EmergencyStop();
			return false;
		}
	}

	return true;
}

static void MoC_RunStabilityTestLoop(void) {
	char str1[16];
	uint32_t seed = HAL_GetTick();
	const int min_x = 10;
	const int max_x = 210;
	const int min_y = 10;
	const int max_y = 300;

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Stability Test  ");
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X10~210 Y10~300");
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Running...      ");

	// 稳定性测试：持续随机移动，便于长时间观察运行稳定性
	while (1) {
		seed = seed * 1664525u + 1013904223u;
		TA531_RC1.TA531_RC_X_trg = min_x + (int) (seed % (max_x - min_x + 1));
		seed = seed * 1664525u + 1013904223u;
		TA531_RC1.TA531_RC_Y_trg = min_y + (int) (seed % (max_y - min_y + 1));

		Clamp_Position(&TA531_RC1.TA531_RC_X_trg, &TA531_RC1.TA531_RC_Y_trg, false);

		TA531_RC1_fg = 2;
		Motor_Protection_Reset();
		Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
		Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
		if (!MoveToTarget_LikeSetXY(MOVE_WAIT_TIMEOUT_INIT_MS)) {
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Stability Stop! ");
			return;
		}

		snprintf(str1, sizeof(str1), "X:%3d Y:%3d", TA531_RC1.TA531_RC_X_trg,
				TA531_RC1.TA531_RC_Y_trg);
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "                ");
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, str1);
		HAL_Delay(150);
	}
}

void Lin_DataProcess_loop_ebs(void) {
	// 保守逻辑：与 0x22 一致，先在循环里打包，再由 RID 0x34 直接发送缓存
	Build_EBS_0x34_Data();
}

void MoC_Init() {
	////42 MotorCtrl init
	SPI_Stop(Flash_SPI);
	HAL_Delay(10);
	SPI_Flash_Start(Flash_SPI);
	HAL_Delay(10);
	MotorInit_M1 = 0;
	MotorInit_M2 = 0;
	MotorInit_M3 = 0;
	MotorInit_M4 = 0;

	MotorCtrl_M1.MotorCtrl_HostID = HostID;
	MotorCtrl_M1.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M1.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M1.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M1.MotorCtrl_DataCode = 0x000000;

	MotorCtrl_M2.MotorCtrl_HostID = HostID;
	MotorCtrl_M2.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M2.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M2.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M2.MotorCtrl_DataCode = 0x000000;

	MotorInit_M1 = 1;	//init wait
	MotorInit_M2 = 1;	//init wait
	MotoCtrl_PackSend12();
	HAL_Delay(MOTOR_INIT_RETRY_MS);

	while ((MotorInit_M1 != 2) | (MotorInit_M2 != 2)) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M1&2 Init Wait ");
		HAL_Delay(MOTOR_INIT_RETRY_MS);
		MotoCtrl_PackSend12();
	}

	char str1[16] = { 0 };

	OLED_ShowString(OLED_I2C_ch, OLED_type, 9, 0, "1 2");	// 9 11 13 15
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M1&2 Init ok! ");

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X: ");
	itoa(M1_ID, str1, 16);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 2, str1);
	itoa(TA531_RC1.TA531_RC_X_act, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, str1);

	MotorCtrl_M3.MotorCtrl_HostID = HostID;
	MotorCtrl_M3.MotorCtrl_FuncType = 0x01;
	MotorCtrl_M3.MotorCtrl_FuncCode = 0x01;
	MotorCtrl_M3.MotorCtrl_ByteData = 0x01;		//06/07
	MotorCtrl_M3.MotorCtrl_DataCode = 0x000000;

	MotorInit_M3 = 1;	//init wait
	MotoCtrl_PackSend3();
	HAL_Delay(MOTOR_INIT_RETRY_MS);

	while (MotorInit_M3 != 2) {
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M3 Init Wait ");
		HAL_Delay(MOTOR_INIT_RETRY_MS);
		MotoCtrl_PackSend3();
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 13, 0, "3 ");	// 9 11 13 15
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "M3 Initialized! ");

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Y: ");
	itoa(M3_ID, str1, 16);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 4, 3, str1);
	itoa(TA531_RC1.TA531_RC_Y_act, str1, 10);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 3, str1);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Check TouchPen! ");
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 1);	//F
	HAL_Delay(700);
	HAL_GPIO_WritePin(KL15_RELAY_GPIO_Port, KL15_RELAY_Pin, 0);	//F
	HAL_Delay(500);

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "PuhUp Rst DispXY");
	HAL_Delay(500);

	if (SW_UP == 1)	////reset display xy
			{
		Sys_tune1();
		OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold Up 2s Reset");
		HAL_Delay(800);
		if (SW_UP == 1)	////reset display xy
				{
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Hold Up 1s Reset");
			HAL_Delay(800);
			Sys_tune1();
			OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, "Release & Reset");
			HAL_Delay(2000);

			if (SW_UP == 0)	// into reset display xy
					{
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1,
						"U/D/L/R Set X0Y0");
				HAL_Delay(800);
				OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 2, "X0:");
				OLED_ShowString(OLED_I2C_ch, OLED_type, 8, 2, "Y0:");

				while (SW_BUTTON == 0)	//no push down
				{
					SW_UP_pre = SW_UP;
					SW_DW_pre = SW_DW;
					SW_LEFT_pre = SW_LEFT;
					SW_RIGHT_pre = SW_RIGHT;
					SW_BUTTON_pre = SW_BUTTON;

					SW_UP = (HAL_GPIO_ReadPin(SW_UP_GPIO_Port, SW_UP_Pin) == 0);
					SW_DW = (HAL_GPIO_ReadPin(SW_DOWN_GPIO_Port, SW_DOWN_Pin)
							== 0);
					SW_LEFT = (HAL_GPIO_ReadPin(SW_LEFT_GPIO_Port, SW_LEFT_Pin)
							== 0);
					SW_RIGHT = (HAL_GPIO_ReadPin(SW_RIGHT_GPIO_Port,
							SW_RIGHT_Pin) == 0);
					SW_BUTTON = (HAL_GPIO_ReadPin(SW_BUTTON_GPIO_Port,
							SW_BUTTON_Pin) == 0);

