YanqiS/stm32temp1/main.c
}

// 停止SPI（禁用SPI外设�???????????
void SPI_Stop(SPI_HandleTypeDef *hspi) {
	// 等待传输完成（检查忙标志�???????????
	while (HAL_SPI_GetState(hspi) == HAL_SPI_STATE_BUSY)
		;

	// 禁用SPI外设（�?�过清除CR1寄存器的SPE位）
	__HAL_SPI_DISABLE(hspi);

	GPIO_InitTypeDef GPIO_InitStruct = { 0 };

	GPIO_InitStruct.Pin = SPI_Flash_NSS_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(SPI_Flash_NSS_GPIO_Port, &GPIO_InitStruct);

	GPIO_InitStruct.Pin = SPI_TFT_NSS_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(SPI_TFT_NSS_GPIO_Port, &GPIO_InitStruct);

	HAL_GPIO_WritePin(SPI_Flash_NSS_GPIO_Port, SPI_Flash_NSS_Pin, 1);
	HAL_GPIO_WritePin(SPI_TFT_NSS_GPIO_Port, SPI_TFT_NSS_Pin, 1);

}

// 重启SPI（重新使能）
void SPI_Flash_Start(SPI_HandleTypeDef *hspi) {
	GPIO_InitTypeDef GPIO_InitStruct = { 0 };

	GPIO_InitStruct.Pin = SPI_Flash_NSS_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(SPI_Flash_NSS_GPIO_Port, &GPIO_InitStruct);

	// 重新使能SPI
	__HAL_SPI_ENABLE(hspi);

	MX_SPI1_Init();

	// Flash CS idle should stay high; each flash command function toggles CS itself.
	HAL_GPIO_WritePin(SPI_Flash_NSS_GPIO_Port, SPI_Flash_NSS_Pin, 1);
	HAL_GPIO_WritePin(SPI_TFT_NSS_GPIO_Port, SPI_TFT_NSS_Pin, 1);
}

void SPI_TFT_Start(SPI_HandleTypeDef *hspi) {
	GPIO_InitTypeDef GPIO_InitStruct = { 0 };

	GPIO_InitStruct.Pin = SPI_TFT_NSS_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(SPI_TFT_NSS_GPIO_Port, &GPIO_InitStruct);

	// 重新使能SPI
	__HAL_SPI_ENABLE(hspi);

	MX_SPI1_Init();

	HAL_GPIO_WritePin(SPI_Flash_NSS_GPIO_Port, SPI_Flash_NSS_Pin, 1);
	HAL_GPIO_WritePin(SPI_TFT_NSS_GPIO_Port, SPI_TFT_NSS_Pin, 0);
}

void Sys_tune1() {
	htim1.Instance = TIM1;
//	  htim1.Init.Prescaler = 63;
//	  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
	htim1.Init.Period = 1000;
//	  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
//	  htim1.Init.RepetitionCounter = 0;
//	  htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
	if (HAL_TIM_PWM_Init(&htim1) != HAL_OK) {
		Error_Handler();
	}

	TIM_OC_InitTypeDef sConfigOC = { 0 };

	sConfigOC.OCMode = TIM_OCMODE_PWM1;
	sConfigOC.Pulse = 200;
//	  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
//	  sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
//	  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
//	  sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
//	  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
	if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1)
			!= HAL_OK) {
		Error_Handler();
	}
	sConfigOC.Pulse = 0;

	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	HAL_Delay(200);
	HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);
}

void Sys_tuneShort(void) {
	htim1.Instance = TIM1;
	htim1.Init.Period = 1000;
	if (HAL_TIM_PWM_Init(&htim1) != HAL_OK) {
		Error_Handler();
	}

	TIM_OC_InitTypeDef sConfigOC = { 0 };
	sConfigOC.OCMode = TIM_OCMODE_PWM1;
	sConfigOC.Pulse = 200;
	if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1)
			!= HAL_OK) {
		Error_Handler();
	}
	sConfigOC.Pulse = 0;

	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	HAL_Delay(50);
	HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);
}

void Sys_tuneX(uint32_t fq)	//fq bigger,sound lower
{

	htim1.Instance = TIM1;
	htim1.Init.Period = fq;
	if (HAL_TIM_PWM_Init(&htim1) != HAL_OK) {
		Error_Handler();
	}

	TIM_OC_InitTypeDef sConfigOC = { 0 };

	sConfigOC.OCMode = TIM_OCMODE_PWM1;
	sConfigOC.Pulse = fq / 4;

	if (HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1)
			!= HAL_OK) {
		Error_Handler();
	}
	sConfigOC.Pulse = 0;

	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	HAL_Delay(200);
	HAL_TIM_PWM_Stop(&htim1, TIM_CHANNEL_1);
}

// 1. 角度转脉宽函数（保持不变）
uint32_t PWMServo_Ag2Pulse(uint32_t ag) {
	uint32_t PWM_Pulse;
	if (ag > PWM_agMAX) {
		ag = PWM_agMAX;
	}
	PWM_Pulse = PWM_ag0 + ag * (PWM_ag90 - PWM_ag0) / 90;
	return PWM_Pulse;
}

// 2. TIM2_CH3 舵机控制（修正版）
void PWMServo2_3_AGout(uint32_t ag) {
	// 直接设置CCR值，不需要重新初始化
	__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_3, PWMServo_Ag2Pulse(ag));
}

// 3. TIM2_CH4 舵机控制（修正版）
void PWMServo2_4_AGout(uint32_t ag) {
	__HAL_TIM_SET_COMPARE(&htim2, TIM_CHANNEL_4, PWMServo_Ag2Pulse(ag));
}

// 4. TIM3_CH1 舵机控制（修正版）
void PWMServo3_1_AGout(uint32_t ag) {
	__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, PWMServo_Ag2Pulse(ag));
}

// 5. TIM3_CH2 舵机控制（修正版）
void PWMServo3_2_AGout(uint32_t ag) {
	__HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_2, PWMServo_Ag2Pulse(ag));
}

/* ========== 电机保护系统实现 ========== */

void Motor_Protection_Init(void) {
	Motor_Protection.last_X_pos = 0;
	Motor_Protection.last_Y_pos = 0;
	Motor_Protection.X_direction_changes = 0;
	Motor_Protection.Y_direction_changes = 0;
	Motor_Protection.stuck_counter = 0;
	Motor_Protection.movement_timeout = 0;
	Motor_Protection.last_progress_tick = HAL_GetTick();
	Motor_Protection.protection_triggered = 0;
	Motor_Protection.error_type = 0;
	Motor_Protection.total_errors = 0;
}

void Motor_Protection_Reset(void) {
	Motor_Protection.X_direction_changes = 0;
	Motor_Protection.Y_direction_changes = 0;
	Motor_Protection.stuck_counter = 0;
	Motor_Protection.movement_timeout = 0;
	Motor_Protection.last_progress_tick = HAL_GetTick();
	Motor_Protection.protection_triggered = 0;
	Motor_Protection.error_type = 0;
}

uint8_t Motor_Protection_Check(int16_t current_X, int16_t current_Y,
		int16_t target_X, int16_t target_Y) {
	uint32_t now_tick = HAL_GetTick();

	if (MOTOR_PROTECTION_ENABLED == 0) {
		return 0;
	}

	if (Motor_Protection.protection_triggered > 0) {
		return 1;
	}

	int16_t delta_X = current_X - Motor_Protection.last_X_pos;
	int16_t delta_Y = current_Y - Motor_Protection.last_Y_pos;

	// ===== 跳过无效采样（位置没更新）=====
	if (delta_X == 0 && delta_Y == 0) {
		Motor_Protection.movement_timeout = now_tick
				- Motor_Protection.last_progress_tick;
		if (Motor_Protection.movement_timeout >= MAX_MOVEMENT_TIMEOUT_MS) {
			Motor_Protection.protection_triggered = 1;
			Motor_Protection.error_type = 3;
			Motor_Protection.total_errors++;
			return 1;
		}
		return 0;  // 跳过停滞检测
	}
	// =====================================

	int16_t target_delta_X = target_X - current_X;
	int16_t target_delta_Y = target_Y - current_Y;

