YanqiS/stm32temp1/main.c
	// 检测1: 方向反复变化
	if (delta_X != 0 && target_delta_X != 0) {
		if ((delta_X > 0 && target_delta_X < 0)
				|| (delta_X < 0 && target_delta_X > 0)) {
			Motor_Protection.X_direction_changes++;

			if (Motor_Protection.X_direction_changes >= MAX_DIRECTION_CHANGES) {
				Motor_Protection.protection_triggered = 1;
				Motor_Protection.error_type = 1;
				Motor_Protection.total_errors++;
				return 1;
			}
		}
	}

	if (delta_Y != 0 && target_delta_Y != 0) {
		if ((delta_Y > 0 && target_delta_Y < 0)
				|| (delta_Y < 0 && target_delta_Y > 0)) {
			Motor_Protection.Y_direction_changes++;

			if (Motor_Protection.Y_direction_changes >= MAX_DIRECTION_CHANGES) {
				Motor_Protection.protection_triggered = 1;
				Motor_Protection.error_type = 1;
				Motor_Protection.total_errors++;
				return 1;
			}
		}
	}

	// 检测2: 位置停滞
	if (abs(delta_X) <= POSITION_TOLERANCE && abs(delta_Y) <= POSITION_TOLERANCE) {
		Motor_Protection.stuck_counter++;

		if (Motor_Protection.stuck_counter >= MAX_STUCK_COUNT) {
			Motor_Protection.protection_triggered = 1;
			Motor_Protection.error_type = 2;
			Motor_Protection.total_errors++;
			return 1;
		}
	} else {
		Motor_Protection.stuck_counter = 0;
	}

	// 检测3: 运动超时（基于毫秒）
	Motor_Protection.last_progress_tick = now_tick;
	Motor_Protection.movement_timeout = 0;

	Motor_Protection.last_X_pos = current_X;
	Motor_Protection.last_Y_pos = current_Y;

	return 0;
}

void Motor_Protection_EmergencyStop(void) {
	Motor_Protection.protection_triggered = 2;
	TA531_RC1_fg = 0;

	char error_msg[20];
	switch (Motor_Protection.error_type) {
	case 1:
		sprintf(error_msg, "ERR:Motor Shake!");
		break;
	case 2:
		sprintf(error_msg, "ERR:Motor Stuck!");
		break;
	case 3:
		sprintf(error_msg, "ERR:Timeout!    ");
		break;
	default:
		sprintf(error_msg, "ERR:Unknown!    ");
		break;
	}

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 0, error_msg);
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Stopping Motor..");

	Sys_tune1();
	HAL_Delay(300);
	Sys_tune1();

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "Resetting...    ");
	TA531_RC1.TA531_RC_X_trg = 0;
	TA531_RC1.TA531_RC_Y_trg = 0;
	Motor_Protection_Reset();
	Motor_Protection.last_X_pos = TA531_RC1.TA531_RC_X_act;
	Motor_Protection.last_Y_pos = TA531_RC1.TA531_RC_Y_act;
	(void) WaitMotorToTargetWithProtection(3000, MOTOR_WAIT_POLL_MS, false);

	TA531_RC1.TA531_RC_Reset = 0;
	TA531_RC1.TA531_RC_Z_code = 0;
	TA531_RC1.TA531_RC_X_Mov = 0;
	TA531_RC1.TA531_RC_Y_Mov = 0;
	TA531_Lock = 0;

	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 3, "System Ready    ");
	Sys_tune1();

	Motor_Protection_Reset();
	HAL_Delay(1000);
}

/* ====================================== */

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */

void Clamp_Position(int *x, int *y, bool allow_reset) {
	// 如果是复位命令，允许归0
	if (allow_reset && (*x == 0 && *y == 0)) {
		return;
	}

	// 确保范围有效（X0 < X1, Y0 < Y1）
	int x_min =
			(ScreenSz_1.DispX0_32b < ScreenSz_1.DispX1_32b) ?
					ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
	int x_max =
			(ScreenSz_1.DispX0_32b > ScreenSz_1.DispX1_32b) ?
					ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
	int y_min =
			(ScreenSz_1.DispY0_32b < ScreenSz_1.DispY1_32b) ?
					ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;
	int y_max =
			(ScreenSz_1.DispY0_32b > ScreenSz_1.DispY1_32b) ?
					ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;

	// 限制X坐标
	if (*x < x_min)
		*x = x_min;
	if (*x > x_max)
		*x = x_max;

	// 限制Y坐标
	if (*y < y_min)
		*y = y_min;
	if (*y > y_max)
		*y = y_max;
}

static bool Position_InBounds(int x, int y, bool allow_reset) {
	if (allow_reset && (x == 0) && (y == 0)) {
		return true;
	}

	int x_min =
			(ScreenSz_1.DispX0_32b < ScreenSz_1.DispX1_32b) ?
					ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
	int x_max =
			(ScreenSz_1.DispX0_32b > ScreenSz_1.DispX1_32b) ?
					ScreenSz_1.DispX0_32b : ScreenSz_1.DispX1_32b;
	int y_min =
			(ScreenSz_1.DispY0_32b < ScreenSz_1.DispY1_32b) ?
					ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;
	int y_max =
			(ScreenSz_1.DispY0_32b > ScreenSz_1.DispY1_32b) ?
					ScreenSz_1.DispY0_32b : ScreenSz_1.DispY1_32b;

	return (x >= x_min) && (x <= x_max) && (y >= y_min) && (y <= y_max);
}

void Door_Control(void) {
	// 声明静态变量保存上次状态（6个门，包括预留）
	static uint8_t door_state_old[6] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };
	uint8_t door_changed = 0;

	// ========== 左前门控制（Y_RELAY_1 / PC2）==========
	if (TA531_Door.Door_FL != door_state_old[0]) {
		door_state_old[0] = TA531_Door.Door_FL;
		door_changed = 1;

		if (TA531_Door.Door_FL == 0) {
			HAL_GPIO_WritePin(Y_RELAY_1_GPIO_Port, Y_RELAY_1_Pin, 0);
		} else if (TA531_Door.Door_FL == 1) {
			HAL_GPIO_WritePin(Y_RELAY_1_GPIO_Port, Y_RELAY_1_Pin, 1);
		}
	}

	// ========== 右前门控制（Y_RELAY_2 / PC3）==========
	if (TA531_Door.Door_FR != door_state_old[1]) {
		door_state_old[1] = TA531_Door.Door_FR;
		door_changed = 1;

		if (TA531_Door.Door_FR == 0) {
			HAL_GPIO_WritePin(Y_RELAY_2_GPIO_Port, Y_RELAY_2_Pin, 0);
		} else if (TA531_Door.Door_FR == 1) {
			HAL_GPIO_WritePin(Y_RELAY_2_GPIO_Port, Y_RELAY_2_Pin, 1);
		}
	}

	// ========== 左后门控制（Y_RELAY_3 / PA2）==========
	if (TA531_Door.Door_RL != door_state_old[2]) {
		door_state_old[2] = TA531_Door.Door_RL;
		door_changed = 1;

		if (TA531_Door.Door_RL == 0) {
			HAL_GPIO_WritePin(Y_RELAY_3_GPIO_Port, Y_RELAY_3_Pin, 0);
		} else if (TA531_Door.Door_RL == 1) {
			HAL_GPIO_WritePin(Y_RELAY_3_GPIO_Port, Y_RELAY_3_Pin, 1);
		}
	}

	// ========== 前引擎盖控制（Y_RELAY_4 / PA3）==========
	if (TA531_Door.Door_Hood != door_state_old[3]) {
		door_state_old[3] = TA531_Door.Door_Hood;
		door_changed = 1;

		if (TA531_Door.Door_Hood == 0) {
			HAL_GPIO_WritePin(Y_RELAY_4_GPIO_Port, Y_RELAY_4_Pin, 0);
		} else if (TA531_Door.Door_Hood == 1) {
			HAL_GPIO_WritePin(Y_RELAY_4_GPIO_Port, Y_RELAY_4_Pin, 1);
		}
	}

	// ========== 后备箱控制（Y_RELAY_5 / PB1）==========
	if (TA531_Door.Door_Trunk != door_state_old[4]) {
		door_state_old[4] = TA531_Door.Door_Trunk;
		door_changed = 1;

