YanqiS/stm32temp1/main.c
		if (TA531_Door.Door_Trunk == 0) {
			HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, 0);
		} else if (TA531_Door.Door_Trunk == 1) {
			HAL_GPIO_WritePin(Y_RELAY_5_GPIO_Port, Y_RELAY_5_Pin, 1);
		}
	}

	// ========== Y_RELAY_6 预留占位（PF6）==========
	if (TA531_Door.Door_Reserve != door_state_old[5]) {
		door_state_old[5] = TA531_Door.Door_Reserve;
		door_changed = 1;

		if (TA531_Door.Door_Reserve == 0) {
			HAL_GPIO_WritePin(Y_RELAY_6_GPIO_Port, Y_RELAY_6_Pin, 0);
		} else if (TA531_Door.Door_Reserve == 1) {
			HAL_GPIO_WritePin(Y_RELAY_6_GPIO_Port, Y_RELAY_6_Pin, 1);
		}
	}

	// ========== 发送门控制ACK报文到CAN1 ==========
	if (door_changed) {
		TSA_Door_Relay_DATA[0] = 0x1A;
		TSA_Door_Relay_DATA[1] = 0x20;
		TSA_Door_Relay_DATA[2] = 0x42;

		// Byte3: FL, FR, RL, Hood（每个2 bits）
		TSA_Door_Relay_DATA[3] = (TA531_Door.Door_FL & 0x03)
				| ((TA531_Door.Door_FR & 0x03) << 2)
				| ((TA531_Door.Door_RL & 0x03) << 4)
				| ((TA531_Door.Door_Hood & 0x03) << 6);

		// Byte4: Trunk, Reserve（每个2 bits，还有4 bits空闲）
		TSA_Door_Relay_DATA[4] = (TA531_Door.Door_Trunk & 0x03)
				| ((TA531_Door.Door_Reserve & 0x03) << 2);

		TSA_Door_Relay_DATA[5] = 0x00;
		TSA_Door_Relay_DATA[6] = 0x00;
		TSA_Door_Relay_DATA[7] = 0x00;

		// 发送到CAN1
		HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan1, &TSA_Door_Relay_Header,
				TSA_Door_Relay_DATA);
	}
}

void Error_Handler(void) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */

	char *str1 = "SYS ERROR!";
	OLED_ShowString(OLED_I2C_ch, OLED_type, 0, 1, str1);

	__disable_irq();
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
